# DpartShapeModified Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DpartShapeModified Property
ParameterTypeId Class See Also
---
"Shape is modified"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DpartShapeModified { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DpartShapeModified As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DpartShapeModified {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace